common/models/Customer.php

SELECT * FROM `customer` WHERE (`id`=11) AND (`active`=1)
---
    public static function findAdvance($condition)
    {
        return static::findOne([
            'AND',
            [
                'OR',
                 ['email' => $condition],
                 ['phone' => $condition],
                 ['username' => $condition]
            ],
            ['active' => self::STATUS_ACTIVE]
        ]);