common/models/User.php

    public static function findBy_Uuid_Fcm_Apn($condition)
    {
        return static::find()->where([
            'and',
            [
                'or',
                ['username' => $condition],
                ['email' => $condition],
                ['id' => $condition],
                ['uuid' => $condition]
            ],
            ['status' => self::STATUS_ACTIVE]
        ])->one();
---
SELECT * FROM `user` WHERE (`username`='admin') AND (`status`=10)