frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }
        @date_default_timezone_set('Asia/Ho_Chi_Minh');
        $Customer = new User([
            'last_name' => $this->last_name,
            'first_name' => $this->first_name,
            'username' => $this->email,
            'email' => $this->email,
            'password' => $this->password,
            'updated_at'=> time(),
            'store_id' => 1, // Domain Weshop Viet Nam
            'active_shipping' => 0,
            'total_xu' => 0,
            'usable_xu' => 0 ,
            'last_revenue_xu' => 0 ,
            'email_verified' => 1 ,  // Nếu là Google Email lấy được rồi nên coi như là dã xác nhận
            'phone_verified' => 0, // Vì là đăng kí qua Google + Facebook nên chưa xác nhân hoặc lấy được số đt của khách hàng
            'gender' => 0 ,
            'type_customer' => 1 , // set 1 là Khách Lẻ và 2 là Khách buôn - WholeSale Customer
            'avatar' => null ,
            'note_by_employee' => 'Khách hàng tạo tài khoản qua theo cách bình thường qua link Weshop',
        ]);
---
SELECT EXISTS(SELECT * FROM `customer` WHERE `customer`.`email`='vienlv@gmail.com')
SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`email`='vienlv@gmail.com')